TOKEN = "6332787339:AAFLFD59jgXVDPoM5RgMhDi5kf9NIeLkIig"

START = "Привет👋! Добро пожаловать в анонимный чат. Для того чтобы найти собеседника, нажмите на кнопку '👫 Поиск собеседника'"

SEARCH = "👫 Поиск собеседника"
STOP_SEARCH = "❌ Отменить поиск"

SEARCH_PROCESS = "⌛ Идёт поиск собеседника...."

STOP_SEARCH_TEXT = "Вы успешно отменили поиск собеседника ✔"

SEARCH_TRUE = "Ваш собеседник найден, для того чтобы найти другого собеседника, напишите команду /next, чтобы закончить напишите команду /stop"

SEARCH_DRUGOGO = "👨 Найти другого"
STOP_DIALOG = "❌ Закончить диалог"

STOP_DIALOG_TEXT = "❌ Вы закончили диалог с собеседником"
SEARCH_DRUGOGO_TEXT = "❌ Вы закончили диалог с собеседником и начали поиск нового собеседника."

STOP_DIALOG_TEXT_SOBESEDNIK = "❌ Ваш собеседник закончил с вами диалог."
CANCEl_STOP_DIALOG_TEXT = "❌ Вы не находитесь в диалоге"
CANCEL_TEXT = "❌ Вы уже находитесь в диалоге."
