TOKEN = "6332787339:AAFLFD59jgXVDPoM5RgMhDi5kf9NIeLkIig"

# START = "Привет! Добро пожаловать в анонимный чат.\nДля того чтобы найти собеседника, напишите /next, или нажмите на кнопку ниже."
#
# SEARCH = "👫 Поиск собеседника"
# STOP_SEARCH = "❌ Отменить поиск"
#
# SEARCH_PROCESS = "⌛ Идёт поиск собеседника...."
#
# STOP_SEARCH_TEXT = "Вы успешно отменили поиск собеседника ✔"
#
# SEARCH_TRUE = "Ваш собеседник найден, для того чтобы найти другого собеседника, напишите команду /next, чтобы закончить напишите команду /stop, либо же воспользуйтесь кнопками ниже."
#
# SEARCH_DRUGOGO = "👨 Найти другого‍"
# STOP_DIALOG = "❌ Закончить диалог"
#
# STOP_DIALOG_TEXT = "Вы закончили диалог с собеседником.\nДля того чтобы найти собеседника, напишите /next"
# SEARCH_DRUGOGO_TEXT = "Вы закончили диалог с собеседником и начали поиск нового собеседника."
#
# STOP_DIALOG_TEXT_SOBESEDNIK = "Ваш собеседник закончил с вами диалог.\nДля того чтобы найти собеседника, напишите /next"
# CANCEl_STOP_DIALOG_TEXT = "❌ Вы не находитесь в диалоге"
# CANCEl_STOP_SEARCH_TEXT = "❌ Вы не находитесь в поиске"
# CANCEL_TEXT = "❌ Вы уже находитесь в диалоге."
# CANCEL_SEARCH_PROCESS = "❌ Вы уже находитесь в поиске."

START = "Բարեւ Ձեզ! Բարի գալուստ անոնիմ չատ:\nՈւղեկից գտնելու համար գրեք /next կամ սեղմեք ստորև նշված կոճակին:"

SEARCH = "👫 Փնտրել զրուցակից"
STOP_SEARCH = "❌ Չեղարկել որոնումը"

SEARCH_PROCESS = "⌛ Փնտրում եմ զրուցակից...."

STOP_SEARCH_TEXT = "Դուք հաջողությամբ չեղարկել եք ուղեկից գտնելու որոնումը ✔"

SEARCH_TRUE = "Ձեր զրուցակիցը գտնվել է, այլ զրուցակից գտնելու համար գրեք /next հրամանը, ավարտելու համար գրեք /stop հրամանը կամ օգտագործեք ստորև նշված կոճակները։"

SEARCH_DRUGOGO = "👨 Փնտրել այլ‍"
STOP_DIALOG = "❌ Ավարտել երկխոսությունը"

STOP_DIALOG_TEXT = "Դուք ավարտել եք երկխոսությունը զրուցակցի հետ։\nԶրուցակցին գտնելու համար մուտքագրեք /next :"
SEARCH_DRUGOGO_TEXT = "Դուք ավարտել եք երկխոսությունը զրուցակցի հետ և սկսել եք նոր զրուցակից փնտրել։"

STOP_DIALOG_TEXT_SOBESEDNIK = "Ձեր զրուցակիցն ավարտել է երկխոսությունը ձեզ հետ:\nԶրուցակցին գտնելու համար մուտքագրեք /next :"
CANCEl_STOP_DIALOG_TEXT = "❌ Դուք երկխոսության մեջ չեք:"
CANCEl_STOP_SEARCH_TEXT = "❌ Դուք որոնման մեջ չեք:"
CANCEL_TEXT = "❌ Դուք արդեն երկխոսության մեջ եք։"
CANCEL_SEARCH_PROCESS = "❌ Դուք արդեն որոնման մեջ եք։"
