TOKEN = "6332787339:AAFLFD59jgXVDPoM5RgMhDi5kf9NIeLkIig"

REGISTER_TEXT = "*Для начало общения, вы должны выбрать ваш пол нажимая на кнопку.*"
ERROR_REGISTER = "*Вы должны выбрать пол, для общения с людьми.\nЕсли у вас возникла какая то ошибка, вводите команду /register*"

START = "*Привет! Добро пожаловать в анонимный чат.\nДля того чтобы найти собеседника, напишите /search, или нажмите на кнопку ниже.*"

SEARCH = "*👫 Начать диалог*"
STOP_SEARCH = "*❌ Отменить поиск*"

CORRECT_MY_LINK = "*Вы успешно дали свой телеграм аккаунт вашему собеседнику ✔*"


SEARCH_PROCESS = "*⌛ Идёт поиск собеседника....*"

STOP_SEARCH_TEXT = "*Вы успешно отменили поиск собеседника ✔*"

SEARCH_TRUE = "*Собеседник найден 😀\n\n/next - искать нового собеседника\n/stop - остановить диалог\n\nhttps://t.me/anonarmbot*"


STOP_DIALOG_TEXT = "*Вы закончили диалог с собеседником.\nДля того чтобы найти собеседника, напишите /next*"
SEARCH_DRUGOGO_TEXT = "*Вы закончили диалог с собеседником и начали поиск нового собеседника.*"

STOP_DIALOG_TEXT_SOBESEDNIK = "*Ваш собеседник закончил с вами диалог.\nДля того чтобы найти собеседника, напишите /next*"
CANCEl_STOP_DIALOG_TEXT = "*❌ Вы не находитесь в поиске*"
CANCEl_STOP_SEARCH_TEXT = "*❌ Вы не находитесь в диалоге*"
CANCEL_TEXT = "*❌ Вы находитесь в диалоге.*"
CANCEL_SEARCH_PROCESS = "*❌ Вы находитесь в поиске.*"

BOT_BLOCKED = "*Переписка с собеседником закончена, ваш собеседник заблокировал бота ❌*"

CANCEL_TEXT_BOT = "*Напишите /search чтобы искать собеседника*"


MALE = "Мужской"
FEMALE = "Женский"

MALE_CORRECT_TEXT = "Вы успешно выбрали мужской пол"
FEMALE_CORRECT_TEXT = "Вы успешно выбрали женский пол"
