TOKEN = "6332787339:AAFLFD59jgXVDPoM5RgMhDi5kf9NIeLkIig"

REGISTER_TEXT = "_Для начало общения, вы должны выбрать ваш пол нажимая на кнопку._"
ERROR_REGISTER = "_Вы должны выбрать пол, для общения с людьми.\nЕсли у вас возникла какая то ошибка, вводите команду /register_"

START = "_Привет! Добро пожаловать в анонимный чат.\nДля того чтобы найти собеседника, напишите /search, или нажмите на кнопку ниже._"

SEARCH = "👫 Начать диалог"
STOP_SEARCH = "❌ Отменить поиск"

CORRECT_MY_LINK = "_Вы успешно дали свой телеграм аккаунт вашему собеседнику ✔_"


SEARCH_PROCESS = "_⌛ Идёт поиск собеседника..._"

STOP_SEARCH_TEXT = "_Вы успешно отменили поиск собеседника ✔_"

SEARCH_TRUE = """_Собеседник найден 🦊\n\n/next - искать нового собеседника\n/stop - остановить диалог\n\ndas`https://t.me/AnonArm_bot`_"""


STOP_DIALOG_TEXT = "_Вы закончили диалог с собеседником.\nДля того чтобы найти собеседника, напишите /search_"
SEARCH_DRUGOGO_TEXT = "_Вы закончили диалог с собеседником и начали поиск нового собеседника._"

STOP_DIALOG_TEXT_SOBESEDNIK = "_Ваш собеседник закончил с вами диалог.\nДля того чтобы найти собеседника, напишите /search_"
CANCEl_STOP_DIALOG_TEXT = "_❌ Вы не находитесь в поиске_"
CANCEl_STOP_SEARCH_TEXT = "_❌ Вы не находитесь в диалоге_"
CANCEL_TEXT = "_❌ Вы находитесь в диалоге._"
CANCEL_SEARCH_PROCESS = "_❌ Вы находитесь в поиске._"

BOT_BLOCKED = "_Переписка с собеседником закончена, ваш собеседник заблокировал бота ❌_"

CANCEL_TEXT_BOT = "_Напишите /search чтобы искать собеседника_"


MALE = "Мужской"
FEMALE = "Женский"

MALE_CORRECT_TEXT = "Вы успешно выбрали мужской пол"
FEMALE_CORRECT_TEXT = "Вы успешно выбрали женский пол"
