TOKEN = "6332787339:AAFLFD59jgXVDPoM5RgMhDi5kf9NIeLkIig"

START = "Привет! Добро пожаловать в анонимный чат.\nДля того чтобы найти собеседника, напишите /next"

SEARCH_PROCESS = "⌛ Идёт поиск собеседника...."

STOP_SEARCH_TEXT = "Вы успешно отменили поиск собеседника."

SEARCH_TRUE = "Ваш собеседник найден, для того чтобы найти другого собеседника, напишите команду /next, чтобы закончить напишите команду /stop"

STOP_DIALOG_TEXT = "Вы закончили диалог с собеседником.\nДля того чтобы найти собеседника, напишите /next"
SEARCH_DRUGOGO_TEXT = "Вы закончили диалог с собеседником и начали поиск нового собеседника."

STOP_DIALOG_TEXT_SOBESEDNIK = "Ваш собеседник закончил с вами диалог.\nДля того чтобы найти собеседника, напишите /next"
CANCEl_STOP_DIALOG_TEXT = "Вы не находитесь в диалоге"
CANCEL_SEARCH_PROCESS = "Вы уже находитесь в поиске."
