TOKEN = "6332787339:AAFLFD59jgXVDPoM5RgMhDi5kf9NIeLkIig"

START = "Привет! Добро пожаловать в анонимный чат.\nДля того чтобы найти собеседника, напишите /next, или нажмите на кнопку ниже."

SEARCH = "👫 Поиск собеседника"
TAKE_MY_LINK = "👉 Прислать свой тг"
STOP_SEARCH = "❌ Отменить поиск"

CORRECT_MY_LINK = "Вы успешно дали свой телеграм аккаунт вашему собеседнику ✔"


SEARCH_PROCESS = "⌛ Идёт поиск собеседника...."

STOP_SEARCH_TEXT = "Вы успешно отменили поиск собеседника ✔"

SEARCH_TRUE = "Ваш собеседник найден, для того чтобы найти другого собеседника, напишите команду /next, чтобы закончить напишите команду /stop, либо же воспользуйтесь кнопками ниже."

SEARCH_DRUGOGO = "👨 Найти другого‍"
STOP_DIALOG = "❌ Закончить диалог"

STOP_DIALOG_TEXT = "Вы закончили диалог с собеседником.\nДля того чтобы найти собеседника, напишите /next"
SEARCH_DRUGOGO_TEXT = "Вы закончили диалог с собеседником и начали поиск нового собеседника."

STOP_DIALOG_TEXT_SOBESEDNIK = "Ваш собеседник закончил с вами диалог.\nДля того чтобы найти собеседника, напишите /next"
CANCEl_STOP_DIALOG_TEXT = "❌ Вы не находитесь в поиске"
CANCEl_STOP_SEARCH_TEXT = "❌ Вы не находитесь в диалоге"
CANCEL_TEXT = "❌ Вы находитесь в диалоге."
CANCEL_SEARCH_PROCESS = "❌ Вы уже находитесь в поиске."

BOT_BLOCKED = "Переписка с собеседником закончена, ваш собеседник заблокировал бота ❌"
